In [2]:
import numpy as np
import pandas as pd

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj.dtypes

dtype('int64')

In [8]:
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
sdata = {"Charles":35000, "Kilho":71000, "Hayoung":16000, "Sangjae":5000}
obj3 = pd.Series(sdata)

In [11]:
obj3

Charles    35000
Kilho      71000
Hayoung    16000
Sangjae     5000
dtype: int64

In [12]:
obj3.name = "Salary"
obj3.index.name = "Names"
obj3

Names
Charles    35000
Kilho      71000
Hayoung    16000
Sangjae     5000
Name: Salary, dtype: int64

In [13]:
obj3.index = ['A','B','C','D']

In [14]:
obj3

A    35000
B    71000
C    16000
D     5000
Name: Salary, dtype: int64

In [15]:
data = {"names":["Kilho","Kilho","Kilho","Charles","Charles"],
       "year" : [2014,2015,2016,2015,2016],
       "points":[1.5,1.7,3.6,2.4,2.9]}
df = pd.DataFrame(data)

In [16]:
df

     names  year  points
0    Kilho  2014     1.5
1    Kilho  2015     1.7
2    Kilho  2016     3.6
3  Charles  2015     2.4
4  Charles  2016     2.9

In [17]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df.columns

Index(['names', 'year', 'points'], dtype='object')

In [19]:
df.values

array([['Kilho', 2014, 1.5],
       ['Kilho', 2015, 1.7],
       ['Kilho', 2016, 3.6],
       ['Charles', 2015, 2.4],
       ['Charles', 2016, 2.9]], dtype=object)

In [20]:
df.index.name = "Num"
df.columns.name = "Info"

In [21]:
df

Info    names  year  points
Num
0       Kilho  2014     1.5
1       Kilho  2015     1.7
2       Kilho  2016     3.6
3     Charles  2015     2.4
4     Charles  2016     2.9

In [22]:
df2 = pd.DataFrame(data,columns = ["year","name","points","penalty"],
                  index = ["one","two","three","four","five"])

In [23]:
df2

       year name  points penalty
one    2014  NaN     1.5     NaN
two    2015  NaN     1.7     NaN
three  2016  NaN     3.6     NaN
four   2015  NaN     2.4     NaN
five   2016  NaN     2.9     NaN

In [24]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [25]:
df2.columns

Index(['year', 'name', 'points', 'penalty'], dtype='object')

In [26]:
df.values

array([['Kilho', 2014, 1.5],
       ['Kilho', 2015, 1.7],
       ['Kilho', 2016, 3.6],
       ['Charles', 2015, 2.4],
       ['Charles', 2016, 2.9]], dtype=object)

In [28]:
df2.describe()

             year    points
count     5.00000  5.000000
mean   2015.20000  2.420000
std       0.83666  0.864292
min    2014.00000  1.500000
25%    2015.00000  1.700000
50%    2015.00000  2.400000
75%    2016.00000  2.900000
max    2016.00000  3.600000